#!/bin/bash





#-----------------------------------------------------------------------------------------------------------------------------------------------------
# 서버 메모리 모니터링
# crontab 활용하여 하루 1번씩 메모리 점유율 체크.
# 다음 3개의 시스템에 대하여 메모리를 모니터링하기 위함임. (plantpulse, scheduler, oee)
# - 최은수 프로
#-----------------------------------------------------------------------------------------------------------------------------------------------------


date;

echo -e '############################################################################';
echo -e '메모리 사용현황 요약';
echo -e '############################################################################';
free -h;


echo -e '\n\n';
echo -e '############################################################################';
echo -e '메모리 점유 TOP 20 상세 정보';
echo -e '############################################################################';


ps -eo user,pid,ppid,rss,size,vsize,pmem,pcpu,time,cmd --sort -rss --no-header | head -n 20 | awk '{
  rss_gb=$4/1024/1024;
  size_gb=$5/1024/1024;
  vsize_gb=$6/1024/1024;
  pmem=$7;
  pcpu=$8;
  time=$9;
  cmd=$10;
  for(i=11;i<=NF;i++) {
    cmd=cmd" "$i;
  }

  printf "user: %s\npid: %s\nppid: %s\nrss: %.2fGB\nsize: %.2fGB\nvsize: %.2fGB\npmem: %.1f%%\npcpu: %.1f%%\ntime: %s\ncmd: %s\n\n",
  $1, $2, $3, rss_gb, size_gb, vsize_gb, pmem, pcpu, time, cmd
}';

